Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: This document describes the usage of the Nim compiler on the different supported platforms.
ja: このドキュメントでは各種プラットフォームをサポートしている Nim コンパイラの用法について解説しています。

source: This document is a tutorial about Nim's macro system.
ja: このドキュメントは Nim のマクロシステムのチュートリアルです。

source: This document is a tutorial for the programming language Nim.
ja: このドキュメントはプログラミング言語 Nim のチュートリアルです。

source: This does not block.
ja: これはブロックできません。

source: This example will create an HTTP server on port 8080.
ja: この用例ではポート 8080 を使って HTTP サーバを作成します。

source: This exception is only supposed to be caught by unit testing frameworks.
ja: この例外はフレームワークのユニットテストに限り捕えられることを想定しています。

source: This exit code tells git bisect to skip the current commit.:
ja: この終了コードにより現在のコミットがスキップされているか判別するには git bisect を使います。

source: This function will remove the data that was returned from the underlying FutureStream.
ja: この関数は潜在的な FutureStream から返されたデータを削除します。

source: This future's callback is activated when two events occur:
ja: future のコールバックは２種類のイベント発生時に動作します。

source: This has NOT yet been (extensively) tested against ODBC drivers for Teradata, Oracle, Sybase, MSSqlvSvr, et.
ja: これはまだ Teradata, Oracle, Sybase, MSSqlvSvr などのデータベースで ODBC ドライバの (広範囲にわたる) 検証が行われていません。

source: This hash-value is computed by storing all textlines into a common hashtable so i can find duplicates in there, and generating a new number each time a new textline is inserted.
ja: このハッシュ値は全てのテキスト行で共用されるハッシュテーブルへ格納して算出をすることで重複を検出します。なお、新しいテキスト行の挿入が起きる度に数値を新規生成します。

source: This helps to prevent race conditions and improves efficiency.
ja: これは競合状態の予防に効果的であり効率性の改善になります。

source: This implementation calls math.randomize() for the first call of genOid.
ja: この実装では genOid の初回呼び出し時に math.randomize() を呼び出します。

source: This implementation was extracted from the Mongodb interface and it thus binary compatible with a Mongo OID.
ja: この実装は Mongodb インターフェースから抽出したものであるため Mongo オブジェクト ID とのバイナリ互換があります。

source: This implements this part of the CGI protocol:
ja: これは CGI プロトコルにおける下記の実装です:

source: This interface is implemented for other databases also.
ja: そのほかのデータベース実装でもインタフェースは共通化してあります。

source: This interface is implemented for other databases too.
ja: そのほかのデータベース実装でもインタフェースは共通化してあります。

source: This is a part of system.nim, you should not manually import it.
ja: これは system.nim の一部であるため、手動でインポートしないでください。

source: This is a raw POSIX interface module.
ja: そのままの POSIX インターフェースを使えるようにしたモジュールです。

source: This is an embedded profiler that requires --profiler:on.
ja: これは組み込み型のプロファイラであり、必要な時は --profiler:on オプションを指定します。

source: This is more efficient than pop() followed by push(), and can be more appropriate when using a fixed-size heap.
ja: これは push() の後に pop() をするよりも効率的であり、固定サイズのヒープを使うよりも適切です。

source: This is not posix compliant, may introduce undefined behavior.
ja: これは POSIX 規格に準拠していないため、未定義動作が起きる場合があります。

source: This is often used to redirect the stdin, stdout or stderr file variables.
ja: これは stdin, stdout または stderr ファイル変数をリダイレクトするときによく使われます。

source: This is only required if the module was compiled with the --define:noUnidecodeTable switch.
ja: この関数は --define:noUnidecodeTable スイッチでモジュールをコンパイルしたときに限り使います。

source: This is only used for speed hacks.
ja: これはスピードハックに限り使います。

source: This is only useful for platform specific programming.
ja: これはプラットフォーム固有のプログラミングに限り有用です。

source: This is roughly equivalent to the async keyword in JavaScript code.
ja: これは JavaScript コードの async キーワードとほぼ等価です。

source: This is still
ja: これは未だ

source: This is supposed to be used as a raw-string-literal modifier: sql"update user set counter = counter + 1"
ja: これは生文字列リテラル修飾子として使われます: sql"update user set counter = counter + 1"

source: This is the default GC.
ja: これはデフォルトのガベージコレクターです。

source: This is the default level.
ja: これはデフォルトのレベルです。

source: This is the number of "type" components or the number of generic parameters a given type t has.
ja: これは "type" のコンポーネント数、または指定された型 t で扱う一般的なパラメータ数です。

source: This is the same interface that is implemented for other databases.
ja: そのほかのデータベース実装でもインタフェースは共通化してあります。

source: This is useful for interfacing closures with C. Source Edit
ja: This is useful for interfacing closures with C. ソース 編集

source: This is useful to not hard-coding the program's version number into the configuration file, for instance.
ja: 実例として、これはコンフィギュレーション・ファイルでプログラムのバージョン番号をハードコードしないときに有用です。

source: This is very fast, but potentially dangerous.
ja: これは非常に高速ですが、潜在的な危険性があります。

source: This is very fast, but potentially dangerous: If the for-loop-body executes another query, the results can be undefined.
ja: これは非常に高速ですが、潜在的な危険性があります: for ループ本体で別のクエリを実行してしまうと結果は未定義 (undefined) となります。

source: This library relies on the header files of your C compiler.
ja: このライブラリは C コンパイラのヘッダファイルに依存します。

source: This macro provides the chaining of function calls.
ja: このマクロは関数を連鎖的に呼び出します。

source: This means essentially that it does not work if the object has some other runtime type than its compiletime type.
ja: つまり、この関数はオブジェクトが compiletime 型とは別のランタイム型ならば基本的に動作しません。

source: This module allows chains of field-access and indexing where the LHS can be nil.
ja: このモジュールはフィールド・アクセスの束縛と左辺が nil になる場所でのインデックス化を実現します。

source: This module allows querying the compiler about diverse configuration settings.
ja: このモジュールはコンパイラの各種コンフィギュレーション設定を照会可能にします。

source: This module also implements the protocol used to format messages, as specified by RFC 2822.
ja: また、このモジュールでは RFC 5321 で制定されたメッセージ形式で用いられるプロトコルを実装してあります。

source: This module contains Nim's support for locks and condition vars.
ja: このモジュールは Nim におけるロックと状態変数に関するサポートです。

source: This module contains Nim's support for reentrant locks.
ja: このモジュールは Nim における再入可能ロック (Reentrant lock) のサポートです。

source: This module contains a few procedures to control the terminal (also called console).
ja: このモジュールにはターミナル (コンソールとも言います) 制御用のプロシージャがあります。

source: This module contains an algorithm to wordwrap a Unicode string.
ja: このモジュールは Unicode 文字列で使えるワードラップ・アルゴリズムの実装です。

source: This module contains basic operating system facilities like retrieving environment variables, reading command line arguments, working with directories, running shell commands, etc.
ja: 環境変数の取得、コマンドライン引数の読み取り、ディレクトリ管理、シェルコマンドの実行などの基本的なオペレーティング・システムの機能です。

source: This module contains code for generating volatile loads and stores, which are useful in embedded and systems programming.
ja: このモジュールは組み込み機器とシステム・プログラミングで便利な volatile のロードと格納処理を生成するコードがあります。

source: This module contains code for reading from stdin.
ja: このモジュールには stdin から読み取るためのコードがあります。

source: This module contains helpers that deal with different byte orders (endian).
ja: このモジュールは異種バイトオーダー (エンディアン) の処理に用いる補助機能の実装です。

source: This module contains procs for serialization and deserialization of arbitrary Nim data structures.
ja: このモジュールは任意 Nim データ構造のシリアライゼーション (serialization)、およびデシリアライゼーション (deserialization) で使えるプロシージャです。

source: This module defines compile-time reflection procs for working with types.
ja: このモジュールは型機能によるコンパイル時リフレクション処理用のプロシージャ定義です。

source: This module does not implement any ORM features such as mapping the types from the schema.
ja: このモジュールはスキーマによる型のマッピングなどの ORM 機能は実装していません。

source: This module implements a crit bit tree which is an efficient container for a sorted set of strings, or for a sorted mapping of strings.
ja: このモジュールは文字列集合のソート、または文字列写像のソートで効率的なコンテナである crit ビットツリーの実装です。

source: This module implements a reStructuredText parser.
ja: このモジュールは reStructuredText パーサーの実装です。

source: This module implements a base object of a lexer with efficient buffer handling.
ja: このモジュールは効率的なバッファ処理による字句解析器 (lexer) の基底オブジェクトの実装です。

source: This module implements a base64 encoder and decoder.
ja: このモジュールは Base64 エンコーダーとデコーダーの実装です。

source: This module implements a helper for a thread pool to determine whether creating a thread is a good idea.
ja: このモジュールはスレッドプールへのスレッド作成が得策であるかの判断に用いる補助機能の実装です。

source: This module implements a high performance asynchronous HTTP server.
ja: このモジュールは高性能な非同期型 HTTP サーバの実装です。

source: This module implements a json parser.
ja: このモジュールは json パーサーの実装です。

source: This module implements a mimetypes database
ja: このモジュールは mimetypes データベースの実装です。

source: This module implements a simple XML and HTML code generator.
ja: このモジュールはシンプルな XML と HTML のコードジェネレータの実装です。

source: This module implements a simple proc for opening URLs with the user's default browser.
ja: このモジュールはユーザのデフォルトブラウザで URL を開くプロシージャの実装です。

source: This module implements a small wrapper for some needed Win API procedures, so that the Nim compiler does not depend on the huge Windows module.
ja: このモジュールは Nim コンパイラは大規模 Windows モジュールに依存していない関係で必要とされる Windows API プロシージャの小規模ラッパーの実装です。

source: This module implements an AST for the reStructuredText parser.
ja: このモジュールは reStructuredText パーサーにおける抽象構文木 (AST) の実装です。

source: This module implements an advanced facility for executing OS processes and process communication.
ja: このモジュールはオペレーティング・システムのプロセスとプロセス通信を行う先進的機能の実装です。

source: This module implements an algorithm to compute the diff between two sequences of lines.
ja: シーケンス同士の行の差異 (diff) を求めるためのアルゴリズムの実装です。

source: This module implements an algorithm to compute the edit distance between two Unicode strings.
ja: このモジュールは二区間にある Unicode 文字列の編集距離を求めるためのアルゴリズムの実装です。

source: This module implements an asynchronous FTP client.
ja: このモジュールは非同期 FTP クライアントの実装です。

source: This module implements asynchronous file reading and writing.
ja: このモジュールは非同期によるファイル読み書き機能の実装です。

source: This module implements color handling for Nim.
ja: このモジュールは Nim で使えるカラー処理の実装です。

source: This module implements complex numbers.
ja: このモジュールは複素数の実装です。

source: This module implements helper procs for CGI applications.
ja: このモジュールはCGIアプリケーションで使える補助プロシージャの実装です。

source: This module implements helper procs for parsing Cookies.
ja: このモジュールは Cookies の解析に用いる補助プロシージャの実装です。

source: This module implements nice syntactic sugar based on Nim's macro system.
ja: このモジュールは Nim のマクロシステムをベースとした素晴らしいシンタックスシュガーの実装です。

source: This module implements procs to determine the number of CPUs / cores.
ja: このモジュールは CPU / コア数を判定するプロシージャの実装です。

source: This module implements some common generic algorithms.
ja: このモジュールは一般的に良く使われるアルゴリズムの実装です。

source: This module implements the with macro for easy function chaining.
ja: このモジュールは連鎖関数を簡単に構築するための with マクロの実装です。

source: This module implements the SMTP client protocol as specified by RFC 5321, this can be used to send mail to any SMTP Server.
ja: このモジュールは RFC 5321 で制定された SMTP クライアントのプロトコルにおける実装であり、 SMTP サーバーへのメール送信で使います。

source: This module implements the ability to access symbols from shared libraries.
ja: このモジュールは共有ライブラリからシンボルへアクセスする機能の実装です。

source: This module implements the basics for Linux distribution ("distro") detection and the OS's native package manager.
ja: このモジュールは Linux ディストリビューション ("ディストロ") の検出、および OS ネイティブのパッケージマネージャで使う基盤技術の実装です。

source: This module implements types and macros for writing asynchronous code for the JS backend.
ja: このモジュールは JS バックエンドにおける非同期コードの型とマクロの実装です。

source: This module is a sample.
ja: このモジュールはサンプルです。

source: This module is based on Python's Unidecode module by Tomaz Solc, which in turn is based on the Text::Unidecode Perl module by Sean M. Burke (http://search.cpan.org/~sburke/Text-Unidecode-0.04/lib/Text/Unidecode.pm ).
ja: このモジュールはショーン・Ｍ・バーク原作の Perl 版 Text::Unidecode モジュール (http://search.cpan.org/~sburke/Text-Unidecode-0.04/lib/Text/Unidecode.pm) の Python 移植版であるトマシュ・ソルク作の Unidecode モジュールをベースにしています。

source: This module is deprecated, import os instead.
ja: このモジュールは廃止されました。 import os をお使いください。

source: This module is experimental and its interface may change.
ja: このモジュールは実験的なものであり、インタフェースは変更されることがあります。

source: This module needs the data file "unidecode.dat" to work: This file is embedded as a resource into your application by default.
ja: このモジュールの動作にはデータファイル "unidecode.dat" が必要です。このファイルはデフォルトのリソースとしてアプリケーションに組み込まれています。

source: This module parses an XML document and creates its XML tree representation.
ja: このモジュールは XML ドキュメントの構文解析と XML ツリー表現を作成します。

source: This module provides an API for macros that need to collect compile time information across module boundaries in global variables.
ja: このモジュールはグローバル変数によりモジュール範囲を越えたコンパイル時情報の収集で必要となる API のマクロ実装です。

source: This module provides further logic operators like 'forall' and 'exists' They are only supported in .ensures etc pragmas.
ja: このモジュールは 'forall' や 'exists' などの論理演算子を扱います。これは .ensures などのプラグマに限りサポートしています。

source: This module provides utilities for reserving a portions of the address space of a program without consuming physical memory.
ja: このモジュールは物理メモリを消費せずにプログラムのアドレス空間の割り当てを保持するユーティリィティ機能です。

source: This module supports helper routines for working with cstring without having to convert cstring to string in order to save allocations.
ja: このモジュールは string (文字列) から cstring への変換で求められる割り当て処理を省いて cstring を処理するための補助機能ルーチンです。

source: This module wraps core JavaScript functions.
ja: このモジュールはコア JavaScript 関数のラッパーです。

source: This modules registers a signal handler that turns access violations / segfaults into a NilAccessError exception.
ja: このモジュールはシグナルハンドラを登録することでアクセス違反 (access violations)、セグメンテーション違反 (segfaults) を NilAccessError 例外に差し替えます。

source: This needs to be called by the main thread before any thread can make a call to unidecode.
ja: いかなるスレッドであろうと unidecode の呼び出し前に、この関数をメインスレッドで必ず呼び出してください。

source: This only works on Unix-style systems: Mac OS X, BSD and Linux Source Edit
ja: This only works on Unix-style systems: Mac OS X, BSD and Linux ソース 編集

source: This opens a converter, uses it and closes it again and is thus more convenient but also likely less efficient than re-using a converter.
ja: これでコンバータを開き、使用後に閉じることを再び行うのは割と使いやすいとはいえ、恐らくコンバータの使い回しよりも効率性は劣ります。

source: This operation is also often called system.
ja: また、この処理は一般に system とも呼ばれています。

source: This operator is useful for generic code, so that $expr also works if expr is already a string.
ja: この演算子は既に expr が文字列であっても $expr は動作するため、一般的なコードで便利です。

source: This page provide hints on distributing Nim using OS packages.
ja: このページは OS パッケージによる Nim の配布方法についてのヒントを解説しています。

source: This proc doesn't raise an exception on error, beware.
ja: このプロシージャのエラーでは例外処理が起きないことに、注意してください。

source: This proc takes a while # to send the message since it sleeps for 2 seconds (or 2000 milliseconds). proc secondWorker() =
ja: このプロシージャは # メッセージの送信で 2 秒間 (2000ミリ秒) の休止をします。 proc secondWorker() =

source: This proc will assert if the node is not of the expected type.
ja: このプロシージャはノートが想定された型ではない場合にアラートを行います。

source: This proc will resolve symlinks.
ja: このプロシージャはシンボリックリンクを解決します。

source: This procedure encodes a string according to MIME spec.
ja: このプロシージャは MIME 仕様により文字列をエンコードします。

source: This procedure encodes a string.
ja: このプロシージャは文字列をエンコードします。

source: This procedure encodes an openarray (array or sequence) of either integers or characters.
ja: このプロシージャは整数、または文字から成る無蓋配列 (無蓋やシーケンス) をエンコードします。

source: This procedure is perfect for saving streamed data to a file without wasting memory.
ja: このプロシージャはメモリを無駄にせずにストリーム形式のデータをファイルへ保存するのに理想的です。

source: This procedure will not close the client socket.
ja: このプロシージャはクライアントのソケットを閉じません。

source: This retrieves ALL rows into memory before iterating through the rows.
ja: これは行をイテレートする前にメモリにある行をすべて取得します。

source: This should NOT be used to compare Nim identifier names.
ja: これは Nim の識別名との比較では使用してはいけません。

source: This simplifies code by reducing need for if-else branches around intermediate values that maybe be nil.
ja: これは前後にある中間値を nil にして必要となる if-else 条件分岐を削減することでコードを単純化します。

source: This suffices because Windows' console already provides the wanted functionality.
ja: Windows のコンソールでは必要な機能が用意されているため、これで十分です。

source: This syntax tree is the interface between the parser and the code generator.
ja: このシンタックスツリーはパーサとコードジェネレータ間のインターフェースです。

source: This throws no exception if the file could not be opened.
ja: これでファイルが開けなくても例外は投げません。

source: This trait is similar to genericHead, but instead of producing error for non-generic types, it will just return them unmodified.
ja: このトレイトは genericHead と似ていますが、違いとしては非ジェネリック型ではエラーが起きない代わりに、無変更のものを返します。

source: This trait returns true iff the type t is safe to use for copyMem.
ja: このトレイは t 型を copyMem で安全に使えるならば true を返します。

source: This traverses the whole string to find the binary zero end marker!
ja: これはバイナリのゼロ終端記号を検出するために文字列全体を横断します！

source: This type contains a description of a person
ja: この型には person の説明があります

source: This uses saturated arithmetic, so that each color component cannot overflow (255 is used as a maximum).
ja: 飽和演算を行うため、カラーコンポーネントの各値はオーバーフローしません (最大値は 255 になります)。

source: This uses saturated arithmetic, so that each color component cannot underflow (0 is used as a minimum).
ja: 飽和演算を行うため、カラーコンポーネントの各値はアンダーフローしません (最小値は 0 になります)。

source: This uses the Levenshtein distance algorithm with only a linear memory overhead.
ja: これはレーベンシュタイン距離のアルゴリズムを使うため線形メモリによるオーバーヘッドが伴います。

# This uses the configuration defined in config im.cfg for lvm_gcc.
source: This uses the configuration defined in config\nim.cfg for lvm_gcc.
ja: これは config\nim.cfg で定義されている lvm_gcc の構成を使います。

source: This will raise ValueError if future is finished.
ja: これは Future が完了しているときに ValueError が発生します。

source: This works for any enumeration type thanks to compiler magic.
ja: これはコンパイラマジックのおかげで、あらゆる列挙型で動作します。

source: Thread pragma
ja: Thread プラグマ

source: Thread support for Nim.
ja: Nim におけるスレッドのサポートです。

source: Threading
ja: スレッド

source: Threads
ja: スレッド

source: Threads and exceptions
ja: スレッドと例外

source: Threadvar pragma
ja: Threadvar プラグマ

source: Three 8-bit bytes (i.e., a total of 24 bits) can therefore be represented by four 6-bit Base64 digits.
ja: したがって、 3 桁の 8 bit バイト (つまり、合計 24 bit) は Base64 において 4 桁の 6 bit 表現になります。

source: Through the nimsuggest tool, any IDE can query a .nim source file and obtain useful information like definition of symbols or suggestions for completion.
ja: nimsuggest ツールにより、 .nim ソースファイルの照会をすることでシンボルの定義、またはの自動補完の提案など有益な情報を IDE で得られます。

source: Thrown in the getContent proc and postContent proc, when the server returns an error Source Edit
ja: Thrown in the getContent proc and postContent proc, when the server returns an error ソース 編集

source: Thrown when matching fails due to invalid unicode in strings Source Edit
ja: Thrown when matching fails due to invalid unicode in strings ソース 編集

source: Thrown when there is a syntax error in the regular expression string passed in Source Edit
ja: Thrown when there is a syntax error in the regular expression string passed in ソース 編集

source: Thus it is generally safer to store channel objects in global variables (as in the above example), in which case they will use a process-wide (thread-safe) shared heap.
ja: 従って、一般には channel オブジェクトをグローバル変数へ格納するほうが安全であり (上述の用例など)、いずれの場合であってもプロセス広域 (スレッドセーフ) の共有ヒープを使います。

source: Time handling
ja: 時刻処理

source: Timer support for the realtime GC.
ja: リアルタイム方式のガベージコレクタではタイマーをサポートしています。

source: To activate the memory profiler you need to do:
ja: メモリプロファイラを有効化するには、

source: To activate the profiler you need to do:
ja: プロファイラを有効化するには、

source: To activate thread support compile with the --threads:on command line switch.
ja: スレッドのサポートを有効にするにはコマンドラインスイッチ --threads:on を付けてコンパイルしてください。

source: To activate thread support you need to compile with the --threads:on command line switch.
ja: スレッドのサポートを有効にするにはコマンドラインスイッチ --threads:on を付けてコンパイルしてください。

source: To be able to catch a NilAccessError all you have to do is to import this module.
ja: NilAccessError を捕らえるには、このモジュールをインポートしてください。

source: To change the compiler from the default compiler (at the command line):
ja: デフォルトのコンパイラから別のコンパイラへ変更するには (コマンドラインにて):

source: To complete the installation, run: sudo apt-get libblas-dev sudo apt-get libvoodoo
ja: インストールを完了するには、下記のコマンドを実行します。 sudo apt-get libblas-dev sudo apt-get libvoodoo

source: To create a new compiler for each run, use koch temp:
ja: 実行するたびに新しいコンパイラを作成するには、 koch temp を使います。

source: To cross compile for Windows from Linux or macOS using the MinGW-w64 toolchain:
ja: Linux または macOS から Windows のクロスコンパイルをするには MinGW-w64 ツールチェーンを使います:

source: To learn about scripting in Nim see NimScript
ja: Nim スクリプトの記述方法を学ぶには NimScript をお読みください。

source: To learn more see Diff on Wikipedia.
ja: Diff の詳細情報については Wikipedia を参照してください。

source: To perform the comparison use the is operator.
ja: 比較処理は is 演算子で行います。

source: To use
ja: コード表記

source: To use a HeapQueue with a custom object, the < operator must be implemented.
ja: カスタムオブジェクトで HeapQueue を使うには、 < 演算子を実装してください。

source: Tools available with Nim
ja: Nim で使えるツール

source: Transforms a into an expression that can be safely evaluated even in presence of intermediate nil pointers/references, in which case a default value is produced.
ja: a を式へ変換します。中間 nil ポインタやリファレンスが存在していても安全に評価可能です。その場合はデフォルト値を生成します。

source: Translates C header files to Nim.
ja: C ヘッダファイルを Nim ファイルへ変換します。

source: Tries to acquire the given lock.
ja: 指定されたロックの取得を試行します。

source: Tries to execute the query and returns true if successful, false otherwise.
ja: クエリの実行を試行します。成功時はtrue を、それ以外は false を返します。

source: Tries to receive a message from the channel c, but this can fail for all sort of reasons, including contention.
ja: チャンネル c からメッセージの受信を試行しますが、競合など様々な要因で失敗することがあります。

source: Tries to reset browser state and writes data to stdout in <plaintext> tag.
ja: ブラウザのステート、ならびに <plaintext> タグで stdout へ書き込まれた data のリセットを試行します。

source: Tries to send a message to a thread.
ja: スレッドへメッセージの送信を試行します。

source: True if child exited due to uncaught signal.
ja: True ならば子プロセスは補足不能 (uncaught) シグナルで終了しています。

source: True if child exited normally.
ja: True ならば子プロセスは正常に終了しています。

source: True if child has been continued.
ja: True ならば子プロセスは再開しています。

source: True if child is currently stopped.
ja: True ならば子プロセスは現在停止しています。

source: Try expression
ja: Try ステートメント

source: Try statement
ja: Try ステートメント

source: Tuple or object scope
ja: タプルまたはオブジェクトのスコープ

source: Tuples
ja: タプル

source: Turn a heap into its string representation.
ja: ヒープを文字列形式へ変換します。

source: Turns a regular function call into an invocation of the JavaScript's new operator Source Edit
ja: Turns a regular function call into an invocation of the JavaScript's new operator ソース 編集

source: Turns an in-place algorithm into one that works on a copy and returns this copy.
ja: インプレース方式 (in-place) のアルゴリズムによりコピー処理をすることで変換したコピーを返します。

source: Turns multiple slashes into single slashes.
ja: 多重スラッシュを単独スラッシュへ変換します。

source: Type
ja: 型

source: Type Class representing valid types for use with atomic procs Source Edit
ja: Type Class representing valid types for use with atomic procs ソース 編集

source: Type Conversion
ja: 型変換

source: Type section
ja: Type セクション

source: Types
ja: 型

source: UNIX domain socket.
ja: UNIX ドメインソケット。

source: UNIX specific
ja: UNIX 専用

source: URL Safe Base64
ja: URL セーフによる Base64

source: Unary minus for complex numbers.
ja: 複素数で使う単項マイナス。

source: Under Mac OS X the open command is used.
ja: Mac OS X では、 open コマンドを使います。

source: Under Unix, it is checked if xdg-open exists and used if it does.
ja: Unix では、 xdg-open コマンドがあれば使います。

source: Under Windows, ShellExecute is used.
ja: Windows では、 ShellExecute を使います。

source: Undocumented.
ja: 非公開です。

source: Unfortunately this means that a profiling build is much slower than a release build.
ja: 残念なことにプロファイリング・ビルドはリリース・ビルドよりも非常に遅くなります。

source: Unicast link-local address.
ja: ユニキャスト方式によるリンク内ローカルアドレス。

source: Unicast site-local address.
ja: ユニキャスト方式によるサイト内ローカルアドレス。

source: Union pragma
ja: Union プラグマ

source: Unix section
ja: Unix セクション

source: UnixBin section
ja: UnixBin セクション

source: Unknown file type.
ja: 不明なファイルの種類。
